In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
# scipi is a library for statistical tests and visualizations
from scipy import stats
# random enables us to generate random numbers
import random

In [5]:
# First, make a variable called url_LondonHousePrices, and assign it the following link, enclosed in quotation-marks as a string:
# https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls
url_LondonHousePrices= "https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls"

In [6]:
# The dataset we're interested in contains the Average prices of the houses, and is actually on a particular sheet of the Excel file.
# As a result, we need to specify the sheet name in the read_excel() method.
# Put this data into a variable called properties.  

properties = pd.read_excel(url_LondonHousePrices, sheet_name='Average price', index_col= None)

In [9]:
# Read the csv file into a data frame called Google using the read_csv() pandas method.
#google = pd.read_csv('googleplaystore.csv')
# Using the head() pandas method, observe the first three entries.
properties = properties.transpose()
properties.head(3)

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,79885.89069,...,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,NaN,53202.77128
2,1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,80897.06551,...,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,NaN,53096.1549
3,1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,81379.86288,...,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,NaN,53201.2843
4,1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,82188.90498,...,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,NaN,53590.8548

In [10]:
properties.reset_index()

,index,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1,1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,...,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,NaN,53202.77128
2,2,1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,...,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,NaN,53096.1549
3,3,1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,...,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,NaN,53201.2843
4,4,1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,...,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,NaN,53590.8548
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
333,333,2022-09-01,830627.92842,348544.55308,604970.15477,402778.1912,579715.65953,512519.58532,849266.39672,431568.03593,...,217808.64959,211252.87161,251188.33102,253335.76477,359751.53833,543870.19531,400485.40296,334462.17766,NaN,312512.97569
334,334,2022-10-01,885696.33847,353195.14125,598727.6565,407103.40353,576500.99942,517698.22668,838390.76911,433740.73082,...,218636.7305,212345.64996,251278.76691,255278.01139,359425.4612,538194.84084,400595.97809,335281.14758,NaN,312878.02395
335,335,2022-11-01,954661.97133,357675.7384,589432.211,406588.79277,570808.32592,516619.17767,836717.61972,432290.33094,...,220668.69197,213120.71483,253901.39741,255091.08649,364910.26901,540433.18365,401390.23209,336876.64716,NaN,314625.84973
336,336,2022-12-01,953204.66901,359579.90996,591520.97288,410458.95974,563864.18263,519752.41804,850933.51313,433313.06694,...,219627.69946,213059.01122,255487.92142,256305.58628,362194.34493,539351.14375,403105.8697,331065.54279,NaN,313893.77267
337,337,2023-01-01,885406.47515,353635.45461,594529.67878,401801.51546,558238.93628,519294.0781,840254.34677,434426.23548,...,214430.59548,207634.72067,251177.24024,256693.67143,358113.58287,533985.89338,398367.70265,329690.82293,NaN,310158.62883

In [11]:
properties.reset_index()

,index,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1,1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,...,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,NaN,53202.77128
2,2,1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,...,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,NaN,53096.1549
3,3,1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,...,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,NaN,53201.2843
4,4,1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,...,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,NaN,53590.8548
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
333,333,2022-09-01,830627.92842,348544.55308,604970.15477,402778.1912,579715.65953,512519.58532,849266.39672,431568.03593,...,217808.64959,211252.87161,251188.33102,253335.76477,359751.53833,543870.19531,400485.40296,334462.17766,NaN,312512.97569
334,334,2022-10-01,885696.33847,353195.14125,598727.6565,407103.40353,576500.99942,517698.22668,838390.76911,433740.73082,...,218636.7305,212345.64996,251278.76691,255278.01139,359425.4612,538194.84084,400595.97809,335281.14758,NaN,312878.02395
335,335,2022-11-01,954661.97133,357675.7384,589432.211,406588.79277,570808.32592,516619.17767,836717.61972,432290.33094,...,220668.69197,213120.71483,253901.39741,255091.08649,364910.26901,540433.18365,401390.23209,336876.64716,NaN,314625.84973
336,336,2022-12-01,953204.66901,359579.90996,591520.97288,410458.95974,563864.18263,519752.41804,850933.51313,433313.06694,...,219627.69946,213059.01122,255487.92142,256305.58628,362194.34493,539351.14375,403105.8697,331065.54279,NaN,313893.77267
337,337,2023-01-01,885406.47515,353635.45461,594529.67878,401801.51546,558238.93628,519294.0781,840254.34677,434426.23548,...,214430.59548,207634.72067,251177.24024,256693.67143,358113.58287,533985.89338,398367.70265,329690.82293,NaN,310158.62883

In [12]:
properties.iloc[[0]]

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001

In [ ]:
properties.columns = properties.iloc[0]

In [13]:
properties.head()

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,79885.89069,...,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,NaN,53202.77128
2,1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,80897.06551,...,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,NaN,53096.1549
3,1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,81379.86288,...,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,NaN,53201.2843
4,1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,82188.90498,...,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,NaN,53590.8548

In [14]:
properties = properties.drop(properties.index[0])

In [15]:
properties.head()

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
1,1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,79885.89069,...,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,NaN,53202.77128
2,1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,80897.06551,...,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,NaN,53096.1549
3,1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,81379.86288,...,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,NaN,53201.2843
4,1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,82188.90498,...,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,NaN,53590.8548
5,1995-05-01,84409.14932,53042.24852,90258.00033,63997.13588,73704.04743,81542.61561,119929.2782,68844.9169,82077.05525,...,44223.61973,44830.98563,45878.00396,50369.66188,56479.80183,75432.02786,64530.36358,54698.83831,NaN,53678.24041

In [28]:
properties = properties.rename(columns = {'Unnamed: 0':'London_Borough', 'Unnamed: 47': 'ID'})

In [30]:
# Try this here: 
clean_properties = pd.melt(properties, id_vars= ['London_Borough', 'ID'])

In [32]:
clean_properties.head()

  London_Borough   ID        variable        value
0     1995-01-01  NaN  City of London  91448.98487
1     1995-02-01  NaN  City of London  82202.77314
2     1995-03-01  NaN  City of London  79120.70256
3     1995-04-01  NaN  City of London  77101.20804
4     1995-05-01  NaN  City of London  84409.14932

In [34]:
# Re-name the column names
clean_properties = clean_properties.rename(columns = {0: 'Month', 'value': 'Average_price'})

In [35]:
clean_properties.head()

  London_Borough   ID        variable Average_price
0     1995-01-01  NaN  City of London   91448.98487
1     1995-02-01  NaN  City of London   82202.77314
2     1995-03-01  NaN  City of London   79120.70256
3     1995-04-01  NaN  City of London   77101.20804
4     1995-05-01  NaN  City of London   84409.14932

In [37]:
# Let's use the .dtypes attribute to check the data types of our clean_properties DataFrame:
clean_properties.dtypes

London_Borough    datetime64[ns]
ID                        object
variable                  object
Average_price             object
dtype: object

In [38]:
# Try this here
clean_properties['Average_price'] = pd.to_numeric(clean_properties['Average_price'])

In [39]:
# Check out the new data types:
clean_properties.dtypes

London_Borough    datetime64[ns]
ID                        object
variable                  object
Average_price            float64
dtype: object

In [72]:
clean_properties.head()

  London_Borough   ID        variable  Average_price
0     1995-01-01  NaN  City of London    91448.98487
1     1995-02-01  NaN  City of London    82202.77314
2     1995-03-01  NaN  City of London    79120.70256
3     1995-04-01  NaN  City of London    77101.20804
4     1995-05-01  NaN  City of London    84409.14932

In [ ]:
clean_properties = clean_properties.rename(columns = {0: 'Month', 'value': 'Average_price'})

In [61]:
# Do this here. 
clean_properties['London_Borough'].unique()

<DatetimeArray>
['1995-01-01 00:00:00', '1995-02-01 00:00:00', '1995-03-01 00:00:00',
 '1995-04-01 00:00:00', '1995-05-01 00:00:00', '1995-06-01 00:00:00',
 '1995-07-01 00:00:00', '1995-08-01 00:00:00', '1995-09-01 00:00:00',
 '1995-10-01 00:00:00',
 ...
 '2022-04-01 00:00:00', '2022-05-01 00:00:00', '2022-06-01 00:00:00',
 '2022-07-01 00:00:00', '2022-08-01 00:00:00', '2022-09-01 00:00:00',
 '2022-10-01 00:00:00', '2022-11-01 00:00:00', '2022-12-01 00:00:00',
 '2023-01-01 00:00:00']
Length: 337, dtype: datetime64[ns]

In [40]:
# To see if there are any missing values, we should call the count() method on our DataFrame:
clean_properties.count()

London_Borough    15839
ID                    0
variable          15839
Average_price     15165
dtype: int64

In [62]:
# Subset clean_properties on the condition: df['London_Borough'] == 'Unnamed: 34' to see what information these rows contain. 
clean_properties[clean_properties['London_Borough'] == 'Unnamed: 34'].head()

Empty DataFrame
Columns: [London_Borough, ID, variable, Average_price]
Index: []

In [63]:
# Let's do the same for 'Unnamed: 37':
clean_properties[clean_properties['London_Borough'] == 'Unnamed: 37'].head()

Empty DataFrame
Columns: [London_Borough, ID, variable, Average_price]
Index: []

In [44]:
# Let's look at how many rows have NAs as their value for ID. 
# To this end, subset clean_properties on the condition: clean_properties['ID'].isna().
# Notice that this line doesn't actually reassign a new value to clean_properties. 
clean_properties[clean_properties['ID'].isna()]

      London_Borough   ID        variable  Average_price
0         1995-01-01  NaN  City of London    91448.98487
1         1995-02-01  NaN  City of London    82202.77314
2         1995-03-01  NaN  City of London    79120.70256
3         1995-04-01  NaN  City of London    77101.20804
4         1995-05-01  NaN  City of London    84409.14932
...              ...  ...             ...            ...
15834     2022-09-01  NaN         England   312512.97569
15835     2022-10-01  NaN         England   312878.02395
15836     2022-11-01  NaN         England   314625.84973
15837     2022-12-01  NaN         England   313893.77267
15838     2023-01-01  NaN         England   310158.62883

[15839 rows x 4 columns]

In [45]:
# Try your hand at method (1) here: 
NaNFreeDF1 = clean_properties[clean_properties['Average_price'].notna()]
NaNFreeDF1.head(48)

   London_Borough   ID        variable  Average_price
0      1995-01-01  NaN  City of London    91448.98487
1      1995-02-01  NaN  City of London    82202.77314
2      1995-03-01  NaN  City of London    79120.70256
3      1995-04-01  NaN  City of London    77101.20804
4      1995-05-01  NaN  City of London    84409.14932
5      1995-06-01  NaN  City of London    94900.51244
6      1995-07-01  NaN  City of London   110128.04230
7      1995-08-01  NaN  City of London   112329.43760
8      1995-09-01  NaN  City of London   104473.10960
9      1995-10-01  NaN  City of London   108038.11810
10     1995-11-01  NaN  City of London   117635.61400
11     1995-12-01  NaN  City of London   127232.44590
12     1996-01-01  NaN  City of London   108998.64490
13     1996-02-01  NaN  City of London    93356.69814
14     1996-03-01  NaN  City of London    93706.70087
15     1996-04-01  NaN  City of London   120542.78710
16     1996-05-01  NaN  City of London   112050.07900
17     1996-06-01  NaN  City of London   114226.18680
18     1996-07-01  NaN  City of London    97546.65538
19     1996-08-01  NaN  City of London   114178.96150
20     1996-09-01  NaN  City of London   108138.34410
21     1996-10-01  NaN  City of London    98934.21106
22     1996-11-01  NaN  City of London    99706.77553
23     1996-12-01  NaN  City of London   106426.64630
24     1997-01-01  NaN  City of London   116343.26320
25     1997-02-01  NaN  City of London   111142.24130
26     1997-03-01  NaN  City of London   107487.77210
27     1997-04-01  NaN  City of London   108480.12650
28     1997-05-01  NaN  City of London   115453.11380
29     1997-06-01  NaN  City of London   118316.63280
30     1997-07-01  NaN  City of London   117033.80260
31     1997-08-01  NaN  City of London   113584.70620
32     1997-09-01  NaN  City of London   115159.36030
33     1997-10-01  NaN  City of London   121251.04810
34     1997-11-01  NaN  City of London   131074.47070
35     1997-12-01  NaN  City of London   130034.77090
36     1998-01-01  NaN  City of London   124381.61480
37     1998-02-01  NaN  City of London   143828.66370
38     1998-03-01  NaN  City of London   156508.21570
39     1998-04-01  NaN  City of London   163402.89020
40     1998-05-01  NaN  City of London   143625.20600
41     1998-06-01  NaN  City of London   132250.91560
42     1998-07-01  NaN  City of London   140377.13100
43     1998-08-01  NaN  City of London   148993.13550
44     1998-09-01  NaN  City of London   152806.82250
45     1998-10-01  NaN  City of London   162019.70740
46     1998-11-01  NaN  City of London   152387.15790
47     1998-12-01  NaN  City of London   155801.27420

In [64]:
# If we do a count on our new DataFrame, we'll see how many rows we have that have complete information: 
NaNFreeDF1.count()

London_Borough    15165
ID                    0
variable          15165
Average_price     15165
dtype: int64

In [65]:
# filtering the data with NaN values
NaNFreeDF2 = clean_properties.dropna()
NaNFreeDF2.head(48)

Empty DataFrame
Columns: [London_Borough, ID, variable, Average_price]
Index: []

In [48]:
# Let's do a count on this DataFrame object: 
NaNFreeDF2.count()

London_Borough    0
ID                0
variable          0
Average_price     0
dtype: int64

In [66]:
NaNFreeDF2['London_Borough'].unique()

<DatetimeArray>
[]
Length: 0, dtype: datetime64[ns]

In [68]:
# Using the .shape attribute, compare the dimenions of clean_properties, NaNFreeDF1, and NaNFreeDF2: 
print(clean_properties.shape)
print(NaNFreeDF1.shape)
print(NaNFreeDF2.shape)

(15839, 4)
(15165, 4)
(0, 4)

In [69]:
clean_properties.columns

Index(['London_Borough', 'ID', 'variable', 'Average_price'], dtype='object')

In [53]:
print(clean_properties)

      London_Borough   ID        variable  Average_price
0         1995-01-01  NaN  City of London    91448.98487
1         1995-02-01  NaN  City of London    82202.77314
2         1995-03-01  NaN  City of London    79120.70256
3         1995-04-01  NaN  City of London    77101.20804
4         1995-05-01  NaN  City of London    84409.14932
...              ...  ...             ...            ...
15834     2022-09-01  NaN         England   312512.97569
15835     2022-10-01  NaN         England   312878.02395
15836     2022-11-01  NaN         England   314625.84973
15837     2022-12-01  NaN         England   313893.77267
15838     2023-01-01  NaN         England   310158.62883

[15839 rows x 4 columns]

In [70]:
clean_properties.head(50)

   London_Borough   ID        variable  Average_price
0      1995-01-01  NaN  City of London    91448.98487
1      1995-02-01  NaN  City of London    82202.77314
2      1995-03-01  NaN  City of London    79120.70256
3      1995-04-01  NaN  City of London    77101.20804
4      1995-05-01  NaN  City of London    84409.14932
5      1995-06-01  NaN  City of London    94900.51244
6      1995-07-01  NaN  City of London   110128.04230
7      1995-08-01  NaN  City of London   112329.43760
8      1995-09-01  NaN  City of London   104473.10960
9      1995-10-01  NaN  City of London   108038.11810
10     1995-11-01  NaN  City of London   117635.61400
11     1995-12-01  NaN  City of London   127232.44590
12     1996-01-01  NaN  City of London   108998.64490
13     1996-02-01  NaN  City of London    93356.69814
14     1996-03-01  NaN  City of London    93706.70087
15     1996-04-01  NaN  City of London   120542.78710
16     1996-05-01  NaN  City of London   112050.07900
17     1996-06-01  NaN  City of London   114226.18680
18     1996-07-01  NaN  City of London    97546.65538
19     1996-08-01  NaN  City of London   114178.96150
20     1996-09-01  NaN  City of London   108138.34410
21     1996-10-01  NaN  City of London    98934.21106
22     1996-11-01  NaN  City of London    99706.77553
23     1996-12-01  NaN  City of London   106426.64630
24     1997-01-01  NaN  City of London   116343.26320
25     1997-02-01  NaN  City of London   111142.24130
26     1997-03-01  NaN  City of London   107487.77210
27     1997-04-01  NaN  City of London   108480.12650
28     1997-05-01  NaN  City of London   115453.11380
29     1997-06-01  NaN  City of London   118316.63280
30     1997-07-01  NaN  City of London   117033.80260
31     1997-08-01  NaN  City of London   113584.70620
32     1997-09-01  NaN  City of London   115159.36030
33     1997-10-01  NaN  City of London   121251.04810
34     1997-11-01  NaN  City of London   131074.47070
35     1997-12-01  NaN  City of London   130034.77090
36     1998-01-01  NaN  City of London   124381.61480
37     1998-02-01  NaN  City of London   143828.66370
38     1998-03-01  NaN  City of London   156508.21570
39     1998-04-01  NaN  City of London   163402.89020
40     1998-05-01  NaN  City of London   143625.20600
41     1998-06-01  NaN  City of London   132250.91560
42     1998-07-01  NaN  City of London   140377.13100
43     1998-08-01  NaN  City of London   148993.13550
44     1998-09-01  NaN  City of London   152806.82250
45     1998-10-01  NaN  City of London   162019.70740
46     1998-11-01  NaN  City of London   152387.15790
47     1998-12-01  NaN  City of London   155801.27420
48     1999-01-01  NaN  City of London   149142.89940
49     1999-02-01  NaN  City of London   164544.68320

In [71]:
import os
print(os.getcwd())

/Users/Owner

In [73]:
clean_properties = clean_properties.rename(columns = {'London_Borough':'Month', 'variable': 'London_Borough'})

In [74]:
clean_properties.head()

       Month   ID  London_Borough  Average_price
0 1995-01-01  NaN  City of London    91448.98487
1 1995-02-01  NaN  City of London    82202.77314
2 1995-03-01  NaN  City of London    79120.70256
3 1995-04-01  NaN  City of London    77101.20804
4 1995-05-01  NaN  City of London    84409.14932

In [75]:
# Do this here. 
clean_properties['London_Borough'].unique()

array(['City of London', 'Barking & Dagenham', 'Barnet', 'Bexley',
       'Brent', 'Bromley', 'Camden', 'Croydon', 'Ealing', 'Enfield',
       'Greenwich', 'Hackney', 'Hammersmith & Fulham', 'Haringey',
       'Harrow', 'Havering', 'Hillingdon', 'Hounslow', 'Islington',
       'Kensington & Chelsea', 'Kingston upon Thames', 'Lambeth',
       'Lewisham', 'Merton', 'Newham', 'Redbridge',
       'Richmond upon Thames', 'Southwark', 'Sutton', 'Tower Hamlets',
       'Waltham Forest', 'Wandsworth', 'Westminster', 'Unnamed: 34',
       'Inner London', 'Outer London', 'Unnamed: 37', 'NORTH EAST',
       'NORTH WEST', 'YORKS & THE HUMBER', 'EAST MIDLANDS',
       'WEST MIDLANDS', 'EAST OF ENGLAND', 'LONDON', 'SOUTH EAST',
       'SOUTH WEST', 'England'], dtype=object)

In [76]:
# Subset clean_properties on the condition: df['London_Borough'] == 'Unnamed: 34' to see what information these rows contain. 
clean_properties[clean_properties['London_Borough'] == 'Unnamed: 34'].head()

           Month   ID London_Borough  Average_price
11121 1995-01-01  NaN    Unnamed: 34            NaN
11122 1995-02-01  NaN    Unnamed: 34            NaN
11123 1995-03-01  NaN    Unnamed: 34            NaN
11124 1995-04-01  NaN    Unnamed: 34            NaN
11125 1995-05-01  NaN    Unnamed: 34            NaN

In [77]:
# Let's do the same for 'Unnamed: 37':
clean_properties[clean_properties['London_Borough'] == 'Unnamed: 37'].head()

           Month   ID London_Borough  Average_price
12132 1995-01-01  NaN    Unnamed: 37            NaN
12133 1995-02-01  NaN    Unnamed: 37            NaN
12134 1995-03-01  NaN    Unnamed: 37            NaN
12135 1995-04-01  NaN    Unnamed: 37            NaN
12136 1995-05-01  NaN    Unnamed: 37            NaN

In [78]:
# Let's look at how many rows have NAs as their value for ID. 
# To this end, subset clean_properties on the condition: clean_properties['ID'].isna().
# Notice that this line doesn't actually reassign a new value to clean_properties. 
clean_properties[clean_properties['ID'].isna()]

           Month   ID  London_Borough  Average_price
0     1995-01-01  NaN  City of London    91448.98487
1     1995-02-01  NaN  City of London    82202.77314
2     1995-03-01  NaN  City of London    79120.70256
3     1995-04-01  NaN  City of London    77101.20804
4     1995-05-01  NaN  City of London    84409.14932
...          ...  ...             ...            ...
15834 2022-09-01  NaN         England   312512.97569
15835 2022-10-01  NaN         England   312878.02395
15836 2022-11-01  NaN         England   314625.84973
15837 2022-12-01  NaN         England   313893.77267
15838 2023-01-01  NaN         England   310158.62883

[15839 rows x 4 columns]

In [79]:
# To delete the rows where the value in the 'London_Borough' column is 'Unnamed: 37'
#clean_properties = clean_properties[clean_properties['London_Borough'] != 'Unnamed: 37']
clean_properties.drop(clean_properties[clean_properties['London_Borough'] == 'Unnamed: 37'].index, inplace=True)
clean_properties.drop(clean_properties[clean_properties['London_Borough'] == 'Unnamed: 34'].index, inplace=True)

In [81]:
clean_properties.head(10000)

          Month   ID  London_Borough  Average_price
0    1995-01-01  NaN  City of London    91448.98487
1    1995-02-01  NaN  City of London    82202.77314
2    1995-03-01  NaN  City of London    79120.70256
3    1995-04-01  NaN  City of London    77101.20804
4    1995-05-01  NaN  City of London    84409.14932
...         ...  ...             ...            ...
9995 2013-07-01  NaN   Tower Hamlets   306442.97310
9996 2013-08-01  NaN   Tower Hamlets   309365.48190
9997 2013-09-01  NaN   Tower Hamlets   311869.90860
9998 2013-10-01  NaN   Tower Hamlets   324529.10480
9999 2013-11-01  NaN   Tower Hamlets   339743.73550

[10000 rows x 4 columns]

In [82]:
print(clean_properties.head())

       Month   ID  London_Borough  Average_price
0 1995-01-01  NaN  City of London    91448.98487
1 1995-02-01  NaN  City of London    82202.77314
2 1995-03-01  NaN  City of London    79120.70256
3 1995-04-01  NaN  City of London    77101.20804
4 1995-05-01  NaN  City of London    84409.14932

In [83]:
# Let's look at how many rows have NAs as their value for ID. 
# To this end, subset clean_properties on the condition: clean_properties['ID'].isna().
# Notice that this line doesn't actually reassign a new value to clean_properties. 
clean_properties[clean_properties['ID'].isna()]

           Month   ID  London_Borough  Average_price
0     1995-01-01  NaN  City of London    91448.98487
1     1995-02-01  NaN  City of London    82202.77314
2     1995-03-01  NaN  City of London    79120.70256
3     1995-04-01  NaN  City of London    77101.20804
4     1995-05-01  NaN  City of London    84409.14932
...          ...  ...             ...            ...
15834 2022-09-01  NaN         England   312512.97569
15835 2022-10-01  NaN         England   312878.02395
15836 2022-11-01  NaN         England   314625.84973
15837 2022-12-01  NaN         England   313893.77267
15838 2023-01-01  NaN         England   310158.62883

[15165 rows x 4 columns]

In [84]:
# Try your hand at method (1) here: 
NaNFreeDF1 = clean_properties[clean_properties['Average_price'].notna()]
NaNFreeDF1.head(48)

        Month   ID  London_Borough  Average_price
0  1995-01-01  NaN  City of London    91448.98487
1  1995-02-01  NaN  City of London    82202.77314
2  1995-03-01  NaN  City of London    79120.70256
3  1995-04-01  NaN  City of London    77101.20804
4  1995-05-01  NaN  City of London    84409.14932
5  1995-06-01  NaN  City of London    94900.51244
6  1995-07-01  NaN  City of London   110128.04230
7  1995-08-01  NaN  City of London   112329.43760
8  1995-09-01  NaN  City of London   104473.10960
9  1995-10-01  NaN  City of London   108038.11810
10 1995-11-01  NaN  City of London   117635.61400
11 1995-12-01  NaN  City of London   127232.44590
12 1996-01-01  NaN  City of London   108998.64490
13 1996-02-01  NaN  City of London    93356.69814
14 1996-03-01  NaN  City of London    93706.70087
15 1996-04-01  NaN  City of London   120542.78710
16 1996-05-01  NaN  City of London   112050.07900
17 1996-06-01  NaN  City of London   114226.18680
18 1996-07-01  NaN  City of London    97546.65538
19 1996-08-01  NaN  City of London   114178.96150
20 1996-09-01  NaN  City of London   108138.34410
21 1996-10-01  NaN  City of London    98934.21106
22 1996-11-01  NaN  City of London    99706.77553
23 1996-12-01  NaN  City of London   106426.64630
24 1997-01-01  NaN  City of London   116343.26320
25 1997-02-01  NaN  City of London   111142.24130
26 1997-03-01  NaN  City of London   107487.77210
27 1997-04-01  NaN  City of London   108480.12650
28 1997-05-01  NaN  City of London   115453.11380
29 1997-06-01  NaN  City of London   118316.63280
30 1997-07-01  NaN  City of London   117033.80260
31 1997-08-01  NaN  City of London   113584.70620
32 1997-09-01  NaN  City of London   115159.36030
33 1997-10-01  NaN  City of London   121251.04810
34 1997-11-01  NaN  City of London   131074.47070
35 1997-12-01  NaN  City of London   130034.77090
36 1998-01-01  NaN  City of London   124381.61480
37 1998-02-01  NaN  City of London   143828.66370
38 1998-03-01  NaN  City of London   156508.21570
39 1998-04-01  NaN  City of London   163402.89020
40 1998-05-01  NaN  City of London   143625.20600
41 1998-06-01  NaN  City of London   132250.91560
42 1998-07-01  NaN  City of London   140377.13100
43 1998-08-01  NaN  City of London   148993.13550
44 1998-09-01  NaN  City of London   152806.82250
45 1998-10-01  NaN  City of London   162019.70740
46 1998-11-01  NaN  City of London   152387.15790
47 1998-12-01  NaN  City of London   155801.27420

In [85]:
# If we do a count on our new DataFrame, we'll see how many rows we have that have complete information: 
NaNFreeDF1.count()

Month             15165
ID                    0
London_Borough    15165
Average_price     15165
dtype: int64

In [86]:
# filtering the data with NaN values
NaNFreeDF2 = clean_properties.dropna()
NaNFreeDF2.head(48)

Empty DataFrame
Columns: [Month, ID, London_Borough, Average_price]
Index: []

In [87]:
# Let's do a count on this DataFrame object: 
NaNFreeDF2.count()

Month             0
ID                0
London_Borough    0
Average_price     0
dtype: int64

In [89]:
NaNFreeDF1['London_Borough'].unique()

array(['City of London', 'Barking & Dagenham', 'Barnet', 'Bexley',
       'Brent', 'Bromley', 'Camden', 'Croydon', 'Ealing', 'Enfield',
       'Greenwich', 'Hackney', 'Hammersmith & Fulham', 'Haringey',
       'Harrow', 'Havering', 'Hillingdon', 'Hounslow', 'Islington',
       'Kensington & Chelsea', 'Kingston upon Thames', 'Lambeth',
       'Lewisham', 'Merton', 'Newham', 'Redbridge',
       'Richmond upon Thames', 'Southwark', 'Sutton', 'Tower Hamlets',
       'Waltham Forest', 'Wandsworth', 'Westminster', 'Inner London',
       'Outer London', 'NORTH EAST', 'NORTH WEST', 'YORKS & THE HUMBER',
       'EAST MIDLANDS', 'WEST MIDLANDS', 'EAST OF ENGLAND', 'LONDON',
       'SOUTH EAST', 'SOUTH WEST', 'England'], dtype=object)

In [90]:
# Using the .shape attribute, compare the dimenions of clean_properties, NaNFreeDF1, and NaNFreeDF2: 
print(clean_properties.shape)
print(NaNFreeDF1.shape)
print(NaNFreeDF2.shape)

(15165, 4)
(15165, 4)
(0, 4)

In [108]:
# A list of non-boroughs. 
nonBoroughs = ['Inner London', 'Outer London', 
               'NORTH EAST', 'NORTH WEST', 'YORKS & THE HUMBER', 
               'EAST MIDLANDS', 'WEST MIDLANDS',
              'EAST OF ENGLAND', 'LONDON', 'SOUTH EAST', 
              'SOUTH WEST', 'England']

In [109]:
# Filter the NaNFreeDF2 DataFrame based on the nonBoroughs list
NaNFreeDF1 = NaNFreeDF1[NaNFreeDF1['London_Borough'].isin(nonBoroughs)]

In [111]:
NaNFreeDF1[~NaNFreeDF1['London_Borough'].isin(nonBoroughs)]

Empty DataFrame
Columns: [Month, ID, London_Borough, Average_price]
Index: []

In [112]:
NaNFreeDF1= NaNFreeDF[~NaNFreeDF1['London_Borough'].isin(nonBoroughs)]

NameError: name 'NaNFreeDF' is not defined

In [113]:
NaNFreeDF1.head()

Empty DataFrame
Columns: [Month, ID, London_Borough, Average_price]
Index: []

In [114]:
# Do that here. 
df = NaNFreeDF1

In [115]:
df.head()

Empty DataFrame
Columns: [Month, ID, London_Borough, Average_price]
Index: []

In [106]:
df.dtypes

NameError: name 'df' is not defined

In [116]:
import os
print(os.getcwd())

/Users/Owner